Конфигурация/AccumulationRegisters/ВводыВыводыАктивовВВалютеУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ВводыВыводыАктивовВВалютеУчета</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>БалансоваяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РыночнаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДвижения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвижений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидАктива</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыАктивов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперацииВводаВыводаДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОперацийПриВводеВыводеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/Enums/ГруппыЗапретаРедактирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ГруппыЗапретаРедактирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БэкОфис</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Партии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проводки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ВводыВыводыАктивовВВалютеУчета/Ext/ManagerModule.bsl
Функция ПолучитьТаблицуПроверкиДатЗапретаРедактирования(НаборЗаписей) Экспорт
	
	// Если меняется рыночная стоимость, значит должен быть открыт бэк-офис,
	// а если балансовая - партии 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	КолонкиНабора				= "Период, Организация, СчетДоверительногоУправления, НаправлениеДвижения, ВидАктива, ВидОперацииВводаВыводаДС, БалансоваяСтоимость, РыночнаяСтоимость, Активность";
	ПредыдущийНаборЗаписей		= ?(НаборЗаписей.ДополнительныеСвойства.Свойство("НаборЗаписейПередЗаписью"), НаборЗаписей.ДополнительныеСвойства.НаборЗаписейПередЗаписью, Неопределено); 
	ТаблицаНабораЗаписей		= НаборЗаписей.Выгрузить(, КолонкиНабора);
	ТаблицаПредыдущегоНабора	= ?(ПредыдущийНаборЗаписей = Неопределено, ТаблицаНабораЗаписей.СкопироватьКолонки(), ПредыдущийНаборЗаписей.Скопировать(, КолонкиНабора));
	
	СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(ТаблицаНабораЗаписей, "_НаборЗаписей", Запрос.МенеджерВременныхТаблиц);
	СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(ТаблицаПредыдущегоНабора, "_ПредыдущийНаборЗаписей", Запрос.МенеджерВременныхТаблиц);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	НАЧАЛОПЕРИОДА(ЕСТЬNULL(_НаборЗаписей.Период, _ПредыдущийНаборЗаписей.Период), ДЕНЬ) КАК Период,
		|	ЕСТЬNULL(_НаборЗаписей.Организация, _ПредыдущийНаборЗаписей.Организация) КАК Организация,
		|	ЕСТЬNULL(_НаборЗаписей.СчетДоверительногоУправления, _ПредыдущийНаборЗаписей.СчетДоверительногоУправления) КАК СчетДоверительногоУправления,
		|	ЕСТЬNULL(_НаборЗаписей.РыночнаяСтоимость <> _ПредыдущийНаборЗаписей.РыночнаяСтоимость, ИСТИНА) КАК РасхождениеРыночнойСтоимости,
		|	ЕСТЬNULL(_НаборЗаписей.БалансоваяСтоимость <> _ПредыдущийНаборЗаписей.БалансоваяСтоимость, ИСТИНА) КАК РасхождениеБалансовойСтоимости
		|ПОМЕСТИТЬ _Расхождения
		|ИЗ
		|	_НаборЗаписей КАК _НаборЗаписей
		|		ПОЛНОЕ СОЕДИНЕНИЕ _ПредыдущийНаборЗаписей КАК _ПредыдущийНаборЗаписей
		|		ПО _НаборЗаписей.Период = _ПредыдущийНаборЗаписей.Период
		|			И _НаборЗаписей.Организация = _ПредыдущийНаборЗаписей.Организация
		|			И _НаборЗаписей.СчетДоверительногоУправления = _ПредыдущийНаборЗаписей.СчетДоверительногоУправления
		|			И _НаборЗаписей.НаправлениеДвижения = _ПредыдущийНаборЗаписей.НаправлениеДвижения
		|			И _НаборЗаписей.ВидАктива = _ПредыдущийНаборЗаписей.ВидАктива
		|			И _НаборЗаписей.ВидОперацииВводаВыводаДС = _ПредыдущийНаборЗаписей.ВидОперацииВводаВыводаДС
		|			И _НаборЗаписей.Активность = _ПредыдущийНаборЗаписей.Активность
		|ГДЕ
		|	(ЕСТЬNULL(_НаборЗаписей.РыночнаяСтоимость <> _ПредыдущийНаборЗаписей.РыночнаяСтоимость, ИСТИНА)
		|			ИЛИ ЕСТЬNULL(_НаборЗаписей.БалансоваяСтоимость <> _ПредыдущийНаборЗаписей.БалансоваяСтоимость, ИСТИНА))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Расхождения.Период КАК Период,
		|	_Расхождения.Организация КАК Организация,
		|	_Расхождения.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ЗНАЧЕНИЕ(Перечисление.ГруппыЗапретаРедактирования.БэкОфис) КАК ГруппаЗапрета,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ПустаяСсылка) КАК ВидУчета
		|ИЗ
		|	_Расхождения КАК _Расхождения
		|ГДЕ
		|	_Расхождения.РасхождениеРыночнойСтоимости
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Расхождения.Период,
		|	_Расхождения.Организация,
		|	_Расхождения.СчетДоверительногоУправления,
		|	ЗНАЧЕНИЕ(Перечисление.ГруппыЗапретаРедактирования.Партии),
		|	ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|ИЗ
		|	_Расхождения КАК _Расхождения
		|ГДЕ
		|	_Расхождения.РасхождениеБалансовойСтоимости";		
	
	ТаблицаПроверкиЗапретаРедактирования = Запрос.Выполнить().Выгрузить();

	Возврат ТаблицаПроверкиЗапретаРедактирования;
	
КонецФункции
